---
kind: property
id: P:Autodesk.Revit.UI.Events.DockableFrameVisibilityChangedEventArgs.DockableFrameShown
source: html/5a50cc4a-5430-2d11-2796-948c99bcafe8.htm
---
# Autodesk.Revit.UI.Events.DockableFrameVisibilityChangedEventArgs.DockableFrameShown Property

True if the pane is being shown, false if it is being hidden.

## Syntax (C#)
```csharp
public bool DockableFrameShown { get; }
```